colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
// b3 not used, reads 0
#define PKTCTRL0_CRC_EN         0x04            // b2 set turns on CRC calculation in RX and TX
#define PKTCTRL0_LENGTH_CFG(x)  (x&0x03)        // b1:0 packet length config
typedef enum
{
    pktCtrl0Len_fixed = 0,
    pktCtrl0Len_variable,
    pktCtrl0Len_infinite,
    pktCtrl0Len_reserved
} pktCtrl0_lenCfg_t;

#define ADDR_REGADDR            0x09        // Device address for Rx filtration.
// b7:0 are address to filter. Optional broadcast addresses are 0x00(default) and 0xFF

#define CHANNR_REGADDR          0x0A        // Channel number, default 0
// b7:0 are channel number, unsigned. Multiplied by channel spacing and added to base frequency

#define FSCTRL1_REGADDR         0x0B        // Frequency synthesizer control
// b7:6 not used, read 0
// b5 reserved, keep at 0
// b4:0 FREQ_IF, defaults to 0x0F
#define FSCTRL1_FREQ_IF(x)      (x&0x0F) // Desired IF frequency in RX

#define FSCTRL0_REGADDR         0x0C        // Frequency synthesizer control
// b7:0 are freqoffset, frequency offset added to base frequency. 2s-complement. Default 0

#define FREQ2_REGADDR           0x0D        // Frequency control word, high byte
// b7:6 are FREQ[23:22], default 0, always 0 with 26 or 27MHz crystal
// b5:0 are FREQ[21:16], base frequency for freq synth. Defaults to 0x1E
#define FREQ1_REGADDR           0x0E        // Frequency control word, middle byte
// b7:0 are FREQ[15:8], default 0xC4
#define FREQ0_REGADDR           0x0F        // Frequency control word, low byte
// b7:0 are FREQ[7:0], default 0xEC. So FREQ[23:0] default is 0x01EC4EC

#define MDMCFG4_REGADDR         0x10        // Modem configuration
// See datasheet
#define MDMCFG3_REGADDR         0x11        // Modem configuration
// See datasheet
#define MDMCFG2_REGADDR         0x12        // Modem configuration
#define MDMCFG2_DEM_DCFILT_OFF  0x08 // b7 disabled if 1
#define MDMCFG2_MOD_FORMAT(x)   ((x<<4)&0x7) // b6:4 modulation format
typedef enum
{
    modFormat_2FSK = 0,
    modFormat_GFSK,
    modFormat_rsvd1,
    modFormat_ASK_OOK,
    modFormat_4FSK,
    modFormat_rsvd2,
    modFormat_rsvd3,
    modFormat_MSK // MSK only supported for data rates above 26kBaud
} mdmcfg2_modFormat_t;
#define MDMCFG2_MANCHESTER_EN   0x08 // Manchester encoding enabled if set
#define MDMCFG2_SYNC_MODE(x)    (x&0x07) // 2:0 are sync mode, combo of sync word qualifier mode
typedef enum
{
    syncMode_noPreamble_sync = 0,
    syncMode_15of16BitsDetected,
    syncMode_16of16BitsDetected,
    syncMode_30of32BitsDetected,
    syncMode_noPreamble_sync_carrierSense, // Just sense above threshold
    syncMode_15of16Bits_carrierSense,
    syncMode_16of16Bits_carrierSense,
    syncMode_30of32Bits_carrierSense

} mdmcfg2_syncMode_t;

#define MDMCFG1_REGADDR         0x13        // Modem configuration
#define MDMCFG1_FEC_EN          0x80 // b7 set to enable forward Error Correction (FEC)
#define MDMCFG1_NUM_PREAMBLE(x) ((x<<4)&0x70) // b6:4 set min num preamble bytes to transmit
typedef enum
{
    preambleBytes_2 = 0,
    preambleBytes_3,
    preambleBytes_4,
    preambleBytes_6,
    preambleBytes_8,
    preambleBytes_12,
    preambleBytes_16,
    preambleBytes_24
} mdmcfg1_numPreamBytes_t;
// b3:2 not used, read 0
#define MDMCFG1_CHANSPC_E(x)    (x&0x03) // b1:0 exponent of channel spacing

#define MDMCFG0_REGADDR         0x14        // Modem configuration
// b7:0 CHANSPC_Mantissa[7:0], see datasheet

#define DEVIATN_REGADDR         0x15        // Modem deviation setting
// b7 not used, reads 0
#define DEVIATN_EXP(x)          ((x<<4)&0x70) // b6:4 exponent of deviation
// b3 not used, reads 0
#define DEVIATN_MANTISSA(x)     (x&0x07) // See datasheet for different uses depending on modulation format

#define MCSM2_REGADDR           0x16        // Main Radio Control State Machine config
// b7:5 not used
#define MCSM2_RX_TIME_RSSI      0x10 // Direct RX termination based on RSSI if set.
#define MCSM2_RX_TIME_QUAL      0x08 // check if sync word is found if set
#define MCSM2_RX_TIME(x)        (x&0x07) // See datasheet

#define MCSM1_REGADDR           0x17        // Main Radio Control State Machine config
// b7:6 not used, read 0
#define MCSM1_CCA_MODE(x)       ((x<<4)&0x30) // b5:4 CCA mode
typedef enum
{
    ccaMode_always = 0,
    ccaMode_RssiBelowThreshold,
    ccaMode_ulessReceiving,
    ccaMode_RssiBelowThresholdUnlessRx // This is default
} mcsm1_ccaMode_t;
#define MCSM1_RXOFF_MODE(x)     ((x<<2)&0xC0) // b3:2 rxoff_mode
typedef enum
{ // What to do once a packet has been received
    rxOff_idle = 0,
    rxOff_fstxon,
    rxOff_Tx,
    rxOff_stayInRx
} mcsm1_rxoffMode_t;
#define MCSM1_TXOFF_MODE(x)     (x&0x03)
typedef enum
{ // What to do once TX is done sending a packet
    txOff_idle = 0,
    txOff_fstxon,
    txOff_stayInTx, // Start sending another preamble
    txOff_Rx
} mcsm1_txoffMode_t;

#define MCSM0_REGADDR           0x18        // Main Radio Control State Machine config
// b7:6 not used, read 0
#define MCSM0_FS_AUTOCAL(x)     ((x<<4)&0x30) // b5:4 auto-cal when going to RX or TX
typedef enum
{
    fsAutocal_never = 0,
    faAutocal_idleToRxOrTx,
    fsAutocal_RxOrTxToIdle,
    fsAutocal_every4thRxOrTxToIdle
} mcsm0_fsAutocal_t;
#define MCSM0_PO_TIMEOUT(x)     ((x<<2)&0xC0) // b3:2 POWER-ON timeout
typedef enum
{
    poTimeout_1count = 0,
    poTimeout_16counts,
    poTimeout_64counts,
    poTimeout_256counts
} mcsm0_poTimeout_t;
#define MCSM0_PIN_CTRL_EN       0x02 // b1 set enables the pin radio control option
#define MCSM0_XOSC_FORCE_ON     0x01 // b0 set forces XOSC to stay on in SLEEP state

#define FOCCFG_REGADDR          0x19        // Frequency Offset Compensation config
// b7:6 not used, read 0
// b5 FOC_BS_CS_GATE
// b4:3 FOC_PRE_K[1:0]
// b2 FOC_POST_K
// b1:0 FOC_LIMIT[1:0]

#define BSCFG_REGADDR           0x1A        // Bit Synchronization configuration

#define AGCCTRL2_REGADDR        0x1B        // AGC control
#define AGCCTRL2_MAX_DVGA_GAIN(x)   ((x<<6)&0xC0) // b7:6 max_dvga_gain[1:0]
#define AGCCTRL2_MAX_LNA_GAIN(x)    ((x<<3)&0x38) // 5:3 max_lna_gain[2:0]
#define AGCCTRL2_MAGN_TARGET(x)     (x&0x07) // b2:0 MAGN_TARGET[2:0]

#define AGCCTRL1_REGADDR        0x1C        // AGC control
// b7 not used, reads 0
#define AGCCTRL1_AGC_LNA_PRIO       0x40 // b6 selects LNA/2 strategies.
#define AGCCTRL1_CSENSE_REL_THR(x)  ((x<<4)&0x30) // b5:4 set relative change threshold for asserting carrier sense
typedef enum
{
    csense_relThresholdDisabled = 0,
    csense_6dBincrease,
    csense_10dBincrease,
    csense_14dBincrease
} agcctrl1_csenseRelThr_t;
#define AGCCTRL1_CSENSE_ABS_THR(x)  (x&0x0F) // b3:0 set absolute threshold for asserting Csense, 2s-complement 4-bit
// See datasheet

#define AGCCTRL0_REGADDR        0x1D        // AGC control
// See datasheet

