colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
#define PKT_SIZE_FIXED 1 // TODO switch to variable later to save power.
#if PKT_SIZE_FIXED
#define PKT_LEN 3

#else
#error "Define packet size or type"
#endif // #if PKT_SIZE_FIXED

typedef enum
{
    packetRxState_awaitingPacketStart,
    packetRxState_awaitingPacketBytes,
    packetRxState_receivedPacketBytes,
    packetRxState_awaitingRSSILQI,
    packetRxState_finishedWithPacket
} packetRxState_t;

typedef struct
{
    uint8_t* pPacket;
    uint32_t packetBufIndex, packetBufLen;
    bool readFromChip;
    pktCtrl0_lenCfg_t packetLenCfg;
    uint8_t expectedPacketLen;
    bool RSSIandLQIAppended;
    int8_t RSSI;
    bool CRCok;
    uint8_t LQI;
    packetRxState_t rxState;

} packetRxSettings_t;

/*************************************************************************************
 *  Variables
 ************************************************************************************/

static uint8_t m_lastChipStatusByte;

#if TX_TEST_ITVL_MS
static uint32_t m_lastTx_ms;
#endif // #if TX_TEST_ITVL_MS

static chipStatusByteState_t m_lastReadStatusByteState;
static uint32_t m_inState_ms;
static uint32_t m_lastPoll_ms;

// For receiving packets
static uint8_t m_rxPacketBuffer[PKT_LEN];
static packetRxSettings_t m_rxSettings;

static cc1101Mode_t m_opMode;

static bool m_newTxPower;
static int8_t m_desiredTxdBm;

const char* m_statuses[statusByteState_txUnderflow + 1]
=
        {
          "idle",
          "rx",
          "tx",
          "fastTxReady",
          "cal",
          "settling",
          "rxOverflow",
          "txUnderflow",
        };

/*************************************************************************************
 *  Prototypes
 ************************************************************************************/

/*************************************************************************************
 *  Functions
 ************************************************************************************/

static void updateStatus(uint8_t newVal)
{
    if (CHIPSTATUSBYTE_STATE(m_lastChipStatusByte) != CHIPSTATUSBYTE_STATE(newVal))
    {
        NRF_LOG_DEBUG("Status from %s to %s", m_statuses[CHIPSTATUSBYTE_STATE(m_lastChipStatusByte)],
                      m_statuses[CHIPSTATUSBYTE_STATE(newVal)]);
    }
    m_lastChipStatusByte = newVal;
}

chipStatusByteState_t cc1101_getLastState(void)
{
    return CHIPSTATUSBYTE_STATE(m_lastChipStatusByte);
}

static bool cc1101_readSingleByte(uint8_t address, uint8_t* pByte)
{
    // Just need the address byte for TX
    uint8_t txByte = (address | CC1101_READ_SINGLE);
    uint8_t rxBytes[2];
    // Send 1 byte, address
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = rxBytes;
    xfer.p_tx_buffer = &txByte;
    xfer.rx_length = 2;
    xfer.tx_length = 1;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, false);
    updateStatus(rxBytes[0]);
//    NRF_LOG_INFO("Wrote 0x%x, read Status 0x%x, byte 0x%x", txByte, rxBytes[0], rxBytes[1]);
    *pByte = rxBytes[1];
    return ret == NRF_SUCCESS ? true : false;
}

// Command strobes are 1-byte addresses which trigger things
static bool cc1101_strobe(uint8_t address)
{
    // Send 1 byte, address to execute a task, read back the status reg
    uint8_t sres;
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = &sres;
    xfer.p_tx_buffer = &address;
    xfer.rx_length = 1;
    xfer.tx_length = 1;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, false);
    if (NRF_SUCCESS == ret)
    {
        NRF_LOG_INFO("Strobed 0x%x, read Status 0x%x", address, sres);
        updateStatus(sres);
        return true;
    }
    else
    {
        NRF_LOG_ERROR("Error %d strobing 0x%x", ret, address);
        return false;
    }
}

static bool cc1101_writeSingleByte(uint8_t address, uint8_t data)
{
    uint8_t tx_data[2];
    tx_data[0] = address;
    tx_data[1] = data;
    uint8_t sres;
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = &sres;
    xfer.p_tx_buffer = tx_data;
    xfer.rx_length = 1;
    xfer.tx_length = 2;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, false);
    if (NRF_SUCCESS == ret)
    {
        //    NRF_LOG_INFO("Wrote address 0x%x to 0x%x, read Status 0x%x", address, data, sres);
        updateStatus(sres);
        return true;
    }
    else
    {
        NRF_LOG_ERROR("Error %d writing reg 0x%x with byte 0x%x", ret, address, data);
        return false;
    }
}

#if 1
static bool cc1101_writeBurst(uint8_t startAddress, uint8_t* data, uint32_t len)
{
    startAddress |= CC1101_WRITE_BURST;
    uint8_t sres;
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = &sres;
    xfer.p_tx_buffer = &startAddress;
    xfer.rx_length = 1;
    xfer.tx_length = 1;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, true);
    if (NRF_SUCCESS == ret)
    {
        updateStatus(sres);
    }
    else
    {
        NRF_LOG_ERROR("Error %d writing startAddress 0x%x", ret, startAddress);
        return false;
    }
    // Else continue
    ret = spi0_write(spi0_cc1101, data, len, false);
    if (NRF_SUCCESS == ret)
    {
        return true;
    }
    else
    {
        NRF_LOG_ERROR("Error %d writing %d regs ", ret, len);
        return false;
    }
}
#else
static bool cc1101_writeBurst(uint8_t startAddress, uint8_t* data, uint32_t len)
{
    startAddress |= CC1101_WRITE_BURST;
    ret_code_t ret = spi0_write(spi0_cc1101, &startAddress, 1, true);
    ret |= spi0_write(spi0_cc1101, data, len, false);
    return ret == NRF_SUCCESS ? true : false;
}
#endif //1

#if 1
static bool cc1101_readBurst(uint8_t startAddress, uint8_t* buffer, uint32_t len)
{
    startAddress |= CC1101_READ_BURST;
    uint8_t sres;
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = &sres;
    xfer.p_tx_buffer = &startAddress;
    xfer.rx_length = 1;
    xfer.tx_length = 1;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, true);
    updateStatus(sres);
    ret |= spi0_read(spi0_cc1101, buffer, len, false);
    return ret == NRF_SUCCESS ? true : false;
}
#else //

static bool cc1101_readBurst(uint8_t startAddress, uint8_t* buffer, uint32_t len)
{
    startAddress |= CC1101_READ_BURST;
    ret_code_t ret = spi0_write(spi0_cc1101, &startAddress, 1, true);
    ret |= spi0_read(spi0_cc1101, buffer, len, false);
    return ret == NRF_SUCCESS ? true : false;
}

#endif // 1

static bool cc1101_reboot(void)
{
    // Wait for it to boot. It will drive MISO low when we drive CS low, if it's ready
    uint32_t retries = 100;
//    uint32_t ms_timestamp = uptimeCounter_getUptimeMs();
    while (retries)
    { //  drive CS low, see if it responds by driving MISO low. Can do this by reading status byte
        cc1101_strobe(STROBE_NOP);
        if (m_lastChipStatusByte & 0x80)
        {
            // Else wait and try again
            nrf_delay_ms(1);
            retries--;
        }
        else
        {
//            NRF_LOG_INFO("Detected CC1101 ready after %d ms, %d retries left", uptimeCounter_elapsedSince(ms_timestamp),
//                         retries);
            break;
        }
    }
    if (!retries)
    {
        NRF_LOG_ERROR("Did not detect CC1101, retries exceeded");
        return false;
    }
#if REBOOT_CC1101
//    NRF_LOG_INFO("Checking for CC1101 to be rebooted:");
    // Issue software reset
    bool ret = cc1101_strobe(STROBE_SRES);
    if (!ret)
    {
        NRF_LOG_WARNING("Failed to send strobe command");
    }
    // Wait for it to reboot. Datasheet says max of
    retries = 100;
    ms_timestamp = uptimeCounter_getUptimeMs();
    while (retries)
    { //  drive CS low, see if it responds by driving MISO low. Can do this by reading status byte
        cc1101_strobe(STROBE_NOP);
        if (m_lastChipStatusByte & 0x80)
        {
            // Else wait and try again
            nrf_delay_ms(1);
            retries--;
        }
        else
        {
            NRF_LOG_INFO("Detected CC1101 ready after %d ms, %d retries left", uptimeCounter_elapsedSince(ms_timestamp),
                         retries);
            break;
        }
    }
    if (!retries)
    {
        NRF_LOG_ERROR("Did not detect CC1101, retries exceeded");
        return false;
    }
#endif // #if REBOOT_CC1101
    return true;
}

static bool cc1101_selfTest(void)
{
    uint8_t partNum;
    uint8_t version;
    bool ret;

