colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
    // Read partNum and version registers
    ret = cc1101_readSingleByte(PARTNUM_REGADDR, &partNum);
    if (ret != true)
    {
        NRF_LOG_ERROR("Error reading PARTNUM");
        return false;
    }
    // CC1101 datasheet says partnum should be 0
    if (0 != partNum)
    {
        NRF_LOG_ERROR("Partnum is %d, expected 0", partNum);
        return false;
    }
    ret = cc1101_readSingleByte(VERSION_REGADDR, &version);
    if (ret != true)
    {
        NRF_LOG_ERROR("Error reading VERSION");
        return ret;
    }
    // Versions in the past have been 20 and 4. Datasheet says subject to change without notice.
    if (0 == version)
    {
        NRF_LOG_ERROR("Version was 0, is SPI set up right?");
        return false;
    }
    if (4 != version)
    {
        NRF_LOG_WARNING("Version is %d, expected %d", version, 4);
        // Continue
    }
    NRF_LOG_INFO("CC1101: Self Test Passed. Detected partnum %d, version %d, status 0x%x", partNum, version,
                 CHIPSTATUSBYTE_STATE(m_lastChipStatusByte));
    return true;

}

void cc1101_setIdle(bool flushFifos)
{
    if (statusByteState_idle != CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
    {
        NRF_LOG_DEBUG("Go from state %s to idle", m_statuses[CHIPSTATUSBYTE_STATE(m_lastChipStatusByte)]);
        cc1101_strobe(STROBE_SIDLE); // Tell it to idle
        uint8_t marcState;
        cc1101_readSingleByte(MARCSTATE_REGADDR, &marcState);
        while (marcState_idle != marcState)
        {
            nrf_delay_us(100);
            cc1101_readSingleByte(MARCSTATE_REGADDR, &marcState);
        } // Make sure it goes into idle
    }
    // Now, if flushFifos, send those strobes
    if (flushFifos)
    {
        NRF_LOG_DEBUG("Flushing RX and TX fifos");
        cc1101_strobe(STROBE_FLUSHTXFIFO); // Can flush in idle
        cc1101_strobe(STROBE_FLUSHRXFIFO); // Can flush in idle
    }
//    nrf_delay_us(100);
}

static void setTxPower(int8_t tx_dBm)
{ // DN013 says don't use 0x61 to 0x6F
    uint8_t desiredPaVal;
    if (tx_dBm <= -62)
    {
        m_desiredTxdBm = -62;
        desiredPaVal = 0x00;
    }
    if (tx_dBm <= -38)
    {
        m_desiredTxdBm = -38;
        desiredPaVal = 0x30;
    }
    if (tx_dBm <= -30)
    {
        m_desiredTxdBm = -30;
        desiredPaVal = 0x12;
    }
    else if (tx_dBm <= -25)
    {
        m_desiredTxdBm = -25;
        desiredPaVal = 0x07;
    }
    else if (tx_dBm <= -20)
    {
        m_desiredTxdBm = -20;
        desiredPaVal = 0x0E;
    }
    else if (tx_dBm <= -15)
    {
        m_desiredTxdBm = -15;
        desiredPaVal = 0x1D;
    }
    else if (tx_dBm <= -10)
    {
        m_desiredTxdBm = -10;
        desiredPaVal = 0x34;
    }
    else if (tx_dBm <= -6)
    {
        m_desiredTxdBm = -6;
        desiredPaVal = 0x2A;
    }
    else if (tx_dBm <= 0)
    {
        m_desiredTxdBm = 0;
        desiredPaVal = 0x60;
    }
    else if (tx_dBm <= 5)
    {
        m_desiredTxdBm = 5;
        desiredPaVal = 0x84;
    }
    else if (tx_dBm <= 7)
    {
        m_desiredTxdBm = 7;
        desiredPaVal = 0xC8;
    }
    else if (tx_dBm <= 9)
    {
        m_desiredTxdBm = 9;
        desiredPaVal = 0xC1;
    }
    else
    {
        m_desiredTxdBm = 10;
        desiredPaVal = 0xC0;
    }

    NRF_LOG_INFO("Switching to %d dBm", m_desiredTxdBm);
#ifdef UART_TX_PIN
    char strBuf[96];
    int strLen = snprintf(strBuf, sizeof(strBuf), "Switching to TX %d dBm\n", m_desiredTxdBm);
    if (0 < strLen)
    {
        uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
    }
#endif // #ifdef UART_TX_PIN

#if ASK_433
    uint8_t paTableBytes[8] = { 0x00, desiredPaVal, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
#else
    uint8_t paTableBytes[8] = { desiredPaVal, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
#endif // #if ASK_433
    if (cc1101_writeBurst(PATABLE_REGADDR, paTableBytes, 8))
    {
        NRF_LOG_INFO("Set PATABLE");
    }
    else
    {
        NRF_LOG_ERROR("ERROR setting PATABLE");
    }
    m_newTxPower = false;
}

#if ASK_433
static void setupPacketRadio(int8_t desiredTx_dBm)
{
    if (statusByteState_idle != CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
    {
        cc1101_setIdle(true); // Idle it before writing configs
    }

    /* Rf settings for CC1101, exported Feb 06, 2024
     * 432.99MHz, XTAL 26MHz
     */
//    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x06);  //GDO0 Output Pin Configuration
#if GDO2_STATUS
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_));
#else
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
#endif // #if GDO2_STATUS

    cc1101_writeSingleByte(IOCFG1_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG0_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));

    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47); //RX FIFO and TX FIFO Thresholds

    //    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05); //Packet Automation Control
    cc1101_writeSingleByte(PKTCTRL1_REGADDR, PKTCTRL1_APPEND_STATUS | PKTCTRL1_ADDR_CHK(addrChk_none));
#if PKT_SIZE_FIXED
//    regByte | = TODO CRC, maybe whitening
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, PKTCTRL0_LENGTH_CFG(pktCtrl0Len_fixed)); //Packet Automation Control
    cc1101_writeSingleByte(PKTLEN_REGADDR, PKT_LEN);
#else
#error "define"
#endif // #if PKT_SIZE_FIXED
    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06); //Frequency Synthesizer Control
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);   //Frequency Control Word_REGADDR, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xA7);   //Frequency Control Word_REGADDR, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x62);   //Frequency Control Word_REGADDR, Low Byte
    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xF5); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x83); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x33); //Modem Configuration
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x15); //Modem Deviation Setting

    // Added MCSM1 to go automatically from TX to RX when sending.
    uint8_t u8 = MCSM1_CCA_MODE(ccaMode_RssiBelowThresholdUnlessRx);
    u8 |= MCSM1_RXOFF_MODE(rxOff_idle); // Go to Idle when done with RX
    u8 |= MCSM1_TXOFF_MODE(txOff_Rx); // Go to TX when done with RX
    cc1101_writeSingleByte(MCSM1_REGADDR, u8);
    // generated: cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);   //Main Radio Control State Machine Configuration
    // Generated had autocal when idle to RX or TX 0x10, and PO_TIMEOUT of 0b10 (0x08)
    u8 = MCSM0_FS_AUTOCAL(faAutocal_idleToRxOrTx);
    u8 |= MCSM0_PO_TIMEOUT(poTimeout_16counts);
    cc1101_writeSingleByte(MCSM0_REGADDR, u8);   //Main Radio Control State Machine Configuration
    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x14);  //Frequency Offset Compensation Configuration
    cc1101_writeSingleByte(AGCCTRL0_REGADDR, 0x92);  //AGC Control
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB); //Wake On Radio Control
    // Studio wanted FREND0 to 0x11, and in OOK, PATABLE[0] is logic 0, PATABLE[1] is logic 1
    cc1101_writeSingleByte(FREND0_REGADDR, 0x11);  //Front End TX Configuration: PA_PWR[2:0] index in b2:0
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);   //Various Test Settings
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);   //Various Test Settings
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);   //Various Test Settings
//    uint8_t paTableBytes[8] = { 0x00, 0x1D, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }; // 0x1D for -15dBm
//    uint8_t paTableBytes[8] = { 0x00, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }; // 0x03 for -30dBm TX power
//    cc1101_writeBurst(PATABLE_REGADDR, paTableBytes, 8);
    setTxPower(desiredTx_dBm);

    NRF_LOG_WARNING("CC1101 setup433PacketTx done, TX dBm %d", m_desiredTxdBm);
}
#endif // #if ASK_433

#if SENSITIVE_433
static void setupPacketRadio(int8_t desiredTx_dBm)
{
    if (statusByteState_idle != CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
    {
        cc1101_setIdle(true); // Idle it before writing configs
    }

    /* Rf settings for CC1101, exported April 17, 2024
     * 432.99MHz, XTAL 26MHz
     */
    //    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x06);  //GDO0 Output Pin Configuration
#if GDO2_STATUS
    // Set up GDO2 to assert at beginning and de-assert at end of packet.
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_syncwordToEndOfPkt));
#else
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
#endif // #if GDO2_STATUS
    // Set all pins to tri-state
    cc1101_writeSingleByte(IOCFG1_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG0_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));

    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47);   //RX FIFO and TX FIFO Thresholds
    cc1101_writeSingleByte(SYNC1_REGADDR, 0xD3);
    cc1101_writeSingleByte(SYNC0_REGADDR, 0x91);
#if PKT_SIZE_FIXED
    cc1101_writeSingleByte(PKTLEN_REGADDR, PKT_LEN);
#endif // #if PKT_SIZE_FIXED

    uint8_t u8 = PKTCTRL1_APPEND_STATUS;
    u8 |= PKTCTRL1_ADDR_CHK(addrChk_none); // No addresses yet
    cc1101_writeSingleByte(PKTCTRL1_REGADDR, u8);

