colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
    // normal mode in b5:4
    //    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05);   //Packet Automation Control
    u8 = 0; // TODO test PKTCTRL0_WHITE_DATA;
    u8 |= PKTCTRL0_CRC_EN;
#if PKT_SIZE_FIXED
    u8 |= PKTCTRL0_LENGTH_CFG(pktCtrl0Len_fixed);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, u8);   //Packet Automation Control
#else
#error "define"
#endif // #if PKT_SIZE_FIXED

    cc1101_writeSingleByte(ADDR_REGADDR, 0x00);
    cc1101_writeSingleByte(CHANNR_REGADDR, 0x00);

    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06);   //Frequency Synthesizer Control
    cc1101_writeSingleByte(FSCTRL0_REGADDR, 0x00);
    // Want 433.0MHz, because boards are that freq
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);   //Frequency Control Word, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xA7);   //Frequency Control Word, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x62);   //Frequency Control Word, Low Byte

    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xF5);   //Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x83);   //Modem Configuration
//    Set mode to GFSK
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x13);   //Modem Configuration
    cc1101_writeSingleByte(MDMCFG1_REGADDR, 0x22);
    cc1101_writeSingleByte(MDMCFG0_REGADDR, 0xF8);
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x31);   //Modem Deviation Setting
    cc1101_writeSingleByte(MCSM2_REGADDR, 0x07);

    // Added MCSM1 to go automatically from TX to RX when sending.
    u8 = MCSM1_CCA_MODE(ccaMode_RssiBelowThresholdUnlessRx);
    u8 |= MCSM1_RXOFF_MODE(rxOff_idle); // Go to Idle when done with RX
    u8 |= MCSM1_TXOFF_MODE(txOff_idle); // Go to TX when done with RX
    cc1101_writeSingleByte(MCSM1_REGADDR, u8);

    // generated: cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);   //Main Radio Control State Machine Configuration
    // Generated had autocal when idle to RX or TX 0x10, and PO_TIMEOUT of 0b10 (0x08)
//    u8 = MCSM0_FS_AUTOCAL(faAutocal_idleToRxOrTx);
//    u8 |= MCSM0_PO_TIMEOUT(poTimeout_64counts);
//    cc1101_writeSingleByte(MCSM0_REGADDR, u8);   //Main Radio Control State Machine Configuration
    cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);

    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x16);   //Frequency Offset Compensation Configuration
    cc1101_writeSingleByte(BSCFG_REGADDR, 0x6C);
    cc1101_writeSingleByte(AGCCTRL2_REGADDR, 0x03);
    cc1101_writeSingleByte(AGCCTRL1_REGADDR, 0x40);
    cc1101_writeSingleByte(AGCCTRL0_REGADDR, 0x91);
    cc1101_writeSingleByte(WOREVT1_REGADDR, 0x87);
    cc1101_writeSingleByte(WOREVT0_REGADDR, 0x6B);
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB);   //Wake On Radio Control
    cc1101_writeSingleByte(FREND1_REGADDR, 0x56);
    cc1101_writeSingleByte(FREND0_REGADDR, 0x10);
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(RCCTRL1_REGADDR, 0x41);
    cc1101_writeSingleByte(RCCTRL0_REGADDR, 0x00);
    cc1101_writeSingleByte(FSTEST_REGADDR, 0x59);
    cc1101_writeSingleByte(PTEST_REGADDR, 0x7F);
    cc1101_writeSingleByte(AGCTEST_REGADDR, 0x3F);
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);   //Various Test Settings
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);   //Various Test Settings
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);   //Various Test Settings

    setTxPower(desiredTx_dBm);
    NRF_LOG_WARNING("CC1101 setupSensitive433 done, TX dBm %d", m_desiredTxdBm);
}
#endif // #if SENSITIVE_433

#if FORUM_433
static void setupPacketRadio(int8_t desiredTx_dBm)
{
// Rf settings for CC1101
//    0x06,  // IOCFG0        GDO0 Output Pin Configuration
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG1_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG0_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));

//    0x47,  // FIFOTHR       RX FIFO and TX FIFO Thresholds
    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47);

//    0x05,  // PKTCTRL0      Packet Automation Control

    // normal mode in b5:4
    //    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05);   //Packet Automation Control
    uint8_t u8 = 0; // TODO | PKTCTRL0_WHITE_DATA;
    u8 |= PKTCTRL0_CRC_EN;
#if PKT_SIZE_FIXED
    u8 |= PKTCTRL0_LENGTH_CFG(pktCtrl0Len_fixed);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, u8);   //Packet Automation Control
    cc1101_writeSingleByte(PKTLEN_REGADDR, PKT_LEN);
#else
#error "define"
#endif // #if PKT_SIZE_FIXED

//    0x06,        // FSCTRL1       Frequency Synthesizer Control
    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06);
    /*0x22,        // FREQ2         Frequency Control Word, High Byte
     0xB6,        // FREQ1         Frequency Control Word, Middle Byte
     0x27,        // FREQ0         Frequency Control Word, Low Byte
     The above is for 915MHz, we need 433
     */
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);   //Frequency Control Word, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xA7);   //Frequency Control Word, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x62);   //Frequency Control Word, Low Byte

//    0xCA,        // MDMCFG4       Modem Configuration
    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xCA);
//    0x83,        // MDMCFG3       Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x83);
//    0x13,        // MDMCFG2       Modem Configuration
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x13);
//    0x35,        // DEVIATN       Modem Deviation Setting
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x35);

    // Added MCSM1 to go automatically from TX to RX when sending.
    u8 = MCSM1_CCA_MODE(ccaMode_RssiBelowThresholdUnlessRx);
    u8 |= MCSM1_RXOFF_MODE(rxOff_idle); // Go to Idle when done with RX
    u8 |= MCSM1_TXOFF_MODE(txOff_Rx); // Go to TX when done with RX
    cc1101_writeSingleByte(MCSM1_REGADDR, u8);

//    0x18,        // MCSM0         Main Radio Control State Machine Configuration
    cc1101_writeSingleByte(MCSM0_REGADDR, 0x18); // 0x18 is cal on idle to RX/TX, and PO timeout 64
//    0x16,        // FOCCFG        Frequency Offset Compensation Configuration
    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x16);
//    0x43,        // AGCCTRL2      AGC Control
    cc1101_writeSingleByte(AGCCTRL2_REGADDR, 0x43);
//    0xFB,        // WORCTRL       Wake On Radio Control
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB);
//    0xE9,        // FSCAL3        Frequency Synthesizer Calibration
//    0x2A,        // FSCAL2        Frequency Synthesizer Calibration
//    0x00,        // FSCAL1        Frequency Synthesizer Calibration
//    0x1F,        // FSCAL0        Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);
//    0x81,        // TEST2         Various Test Settings
//    0x35,        // TEST1         Various Test Settings
//    0x09,        // TEST0         Various Test Settings
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);

    setTxPower(desiredTx_dBm);
    NRF_LOG_WARNING("CC1101 setupForum433 done, TX dBm %d", m_desiredTxdBm);

