colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
}
#endif // #if FORUM_433

#if SENSITIVE_915
static void setupPacketRadio(int8_t desiredTx_dBm)
{
    if (statusByteState_idle != CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
    {
        cc1101_setIdle(true); // Idle it before writing configs
    }

    /* Rf settings for CC1101, exported April 18, 2024
     * 915.00MHz, XTAL 26MHz
     */
    //    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x06);  //GDO0 Output Pin Configuration
    // Set all pins to tri-state
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG1_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG0_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));

    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47);   //RX FIFO and TX FIFO Thresholds
    uint8_t u8 = PKTCTRL1_APPEND_STATUS;
    u8 |= PKTCTRL1_ADDR_CHK(addrChk_none); // No addresses yet
    cc1101_writeSingleByte(PKTCTRL1_REGADDR, u8);
    // normal mode in b5:4
    //    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05);   //Packet Automation Control
    u8 = 0; // TODO test PKTCTRL0_WHITE_DATA;
    u8 |= PKTCTRL0_CRC_EN;
#if PKT_SIZE_FIXED
    u8 |= PKTCTRL0_LENGTH_CFG(pktCtrl0Len_fixed);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, u8);   //Packet Automation Control
    cc1101_writeSingleByte(PKTLEN_REGADDR, PKT_LEN);
#else
#error "define"
#endif // #if PKT_SIZE_FIXED

    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06);   //Frequency Synthesizer Control
    // Want 433.0MHz, because boards are that freq
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x23);   //Frequency Control Word, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0x31);   //Frequency Control Word, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x3B);   //Frequency Control Word, Low Byte

    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xC7);   //Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x83);   //Modem Configuration
//    Set mode to GFSK
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x13);   //Modem Configuration

    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x40);   //Modem Deviation Setting

    // Added MCSM1 to go automatically from TX to RX when sending.
    u8 = MCSM1_CCA_MODE(ccaMode_RssiBelowThresholdUnlessRx);
    u8 |= MCSM1_RXOFF_MODE(rxOff_idle); // Go to Idle when done with RX
    u8 |= MCSM1_TXOFF_MODE(txOff_Rx); // Go to TX when done with RX
    cc1101_writeSingleByte(MCSM1_REGADDR, u8);

    // Generated had autocal when idle to RX or TX 0x10, and PO_TIMEOUT of 0b10 (0x08)
    cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);    //Main Radio Control State Machine Configuration

    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x16);   //Frequency Offset Compensation Configuration

    cc1101_writeSingleByte(AGCCTRL2_REGADDR, 0x43);  //AGC Control

    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB);   //Wake On Radio Control
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);   //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);   //Various Test Settings
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);   //Various Test Settings
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);   //Various Test Settings

    setTxPower(desiredTx_dBm);
    NRF_LOG_WARNING("CC1101 setupSensitive915 done, TX dBm %d", m_desiredTxdBm);
}

#endif // #if SENSITIVE_915

#if FORUM_915
//https://e2e.ti.com/support/wireless-connectivity/sub-1-ghz-group/sub-1-ghz/f/sub-1-ghz-forum/1275571/cc1101-unable-to-recevie-packets-with-rssi-value-less-than--70-dbm-at-904mhz
static void setupPacketRadio(int8_t desiredTx_dBm)
{
// Rf settings for CC1101
//    0x06,  // IOCFG0        GDO0 Output Pin Configuration
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG1_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG0_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));

//    0x47,  // FIFOTHR       RX FIFO and TX FIFO Thresholds
    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47);

//    0x05,  // PKTCTRL0      Packet Automation Control

    // normal mode in b5:4
    //    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05);   //Packet Automation Control
    uint8_t u8 = 0; // TODO | PKTCTRL0_WHITE_DATA;
    u8 |= PKTCTRL0_CRC_EN;
#if PKT_SIZE_FIXED
    u8 |= PKTCTRL0_LENGTH_CFG(pktCtrl0Len_fixed);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, u8);   //Packet Automation Control
    cc1101_writeSingleByte(PKTLEN_REGADDR, PKT_LEN);
#else
#error "define"
#endif // #if PKT_SIZE_FIXED

//    0x06,        // FSCTRL1       Frequency Synthesizer Control
    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06);
    /*0x22,        // FREQ2         Frequency Control Word, High Byte
     0xB6,        // FREQ1         Frequency Control Word, Middle Byte
     0x27,        // FREQ0         Frequency Control Word, Low Byte
     The above is for 915MHz
     */
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x22);   //Frequency Control Word, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xB6);   //Frequency Control Word, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x27);   //Frequency Control Word, Low Byte

//    0xCA,        // MDMCFG4       Modem Configuration
    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xCA);
//    0x83,        // MDMCFG3       Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x83);
//    0x13,        // MDMCFG2       Modem Configuration
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x13);
//    0x35,        // DEVIATN       Modem Deviation Setting
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x35);

    // Added MCSM1 to go automatically from TX to RX when sending.
    u8 = MCSM1_CCA_MODE(ccaMode_RssiBelowThresholdUnlessRx);
    u8 |= MCSM1_RXOFF_MODE(rxOff_idle); // Go to Idle when done with RX
    u8 |= MCSM1_TXOFF_MODE(txOff_Rx); // Go to TX when done with RX
    cc1101_writeSingleByte(MCSM1_REGADDR, u8);

//    0x18,        // MCSM0         Main Radio Control State Machine Configuration
    cc1101_writeSingleByte(MCSM0_REGADDR, 0x18); // 0x18 is cal on idle to RX/TX, and PO timeout 64
//    0x16,        // FOCCFG        Frequency Offset Compensation Configuration
    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x16);
//    0x43,        // AGCCTRL2      AGC Control
    cc1101_writeSingleByte(AGCCTRL2_REGADDR, 0x43);
//    0xFB,        // WORCTRL       Wake On Radio Control
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB);
//    0xE9,        // FSCAL3        Frequency Synthesizer Calibration
//    0x2A,        // FSCAL2        Frequency Synthesizer Calibration
//    0x00,        // FSCAL1        Frequency Synthesizer Calibration
//    0x1F,        // FSCAL0        Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);
//    0x81,        // TEST2         Various Test Settings
//    0x35,        // TEST1         Various Test Settings
//    0x09,        // TEST0         Various Test Settings
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);

    setTxPower(desiredTx_dBm);
    NRF_LOG_WARNING("CC1101 setupForum433 done, TX dBm %d", m_desiredTxdBm);

