colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
}
#endif // #if FORUM_915

#if locustcox_433

static void setupPacketRadio(int8_t desiredTx_dBm)
{
    char PA[] = { 0x60 };
    const unsigned char PA_LEN = 1;
    /* Sync word qualifier mode = 30/32 sync word bits detected */
    /* CRC autoflush = false */
    /* Channel spacing = 199.951172 */
    /* Data format = Normal mode */
    /* Data rate = 512.573 */
    /* RX filter BW = 58.035714 */
    /* PA ramping = false */
    /* Preamble count = 4 */
    /* Whitening = false */
    /* Address config = No address check */
    /* Carrier frequency = 433.999969 */
    /* Device address = 0 */
    /* TX power = 0 */
    /* Manchester enable = true */
    /* CRC enable = true */
    /* Deviation = 5.157471 */
    /* Packet length mode = Variable packet length mode. Packet length configured by the first byte after sync word */
    /* Packet length = 255 */
    /* Modulation format = GFSK */
    /* Base frequency = 433.999969 */
    /* Modulated = true */
    /* Channel number = 0 */
//-------------------------------------------------------
//Register Settings for CC1101
//-Generated by the Awesomely Awesome SmartRF(c) studio
//-------------------------------------------------------
    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x06);
    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47);
//    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05);
    uint8_t u8 = 0; // TODO | PKTCTRL0_WHITE_DATA;
    u8 |= PKTCTRL0_CRC_EN;
#if PKT_SIZE_FIXED
    u8 |= PKTCTRL0_LENGTH_CFG(pktCtrl0Len_fixed);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, u8);   //Packet Automation Control
    cc1101_writeSingleByte(PKTLEN_REGADDR, PKT_LEN);
#else
#error "define"
#endif // #if PKT_SIZE_FIXED
    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06);
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xB1);
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x3B);

    // Added MCSM1 to go automatically from TX to RX when sending.
    u8 = MCSM1_CCA_MODE(ccaMode_RssiBelowThresholdUnlessRx);
    u8 |= MCSM1_RXOFF_MODE(rxOff_idle); // Go to Idle when done with RX
    u8 |= MCSM1_TXOFF_MODE(txOff_Rx); // Go to TX when done with RX
    cc1101_writeSingleByte(MCSM1_REGADDR, u8);

    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xFE);
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x43);
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x1B);
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x15);
    cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);
    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x16);
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB);
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xEA);
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);

    cc1101_writeBurst(PATABLE_REGADDR, PA, PA_LEN);
}
#endif // #if locustcox_433

/* Packet sniffer settings Feb 06 2024
 # ---------------------------------------------------
 # Packet sniffer settings for CC1101
 # ---------------------------------------------------
 IOCFG0   |0x0002|0x06|GDO0 Output Pin Configuration
 FIFOTHR  |0x0003|0x47|RX FIFO and TX FIFO Thresholds
 PKTCTRL0 |0x0008|0x05|Packet Automation Control
 FSCTRL1  |0x000B|0x06|Frequency Synthesizer Control
 FREQ2    |0x000D|0x10|Frequency Control Word, High Byte
 FREQ1    |0x000E|0xA7|Frequency Control Word, Middle Byte
 FREQ0    |0x000F|0x62|Frequency Control Word, Low Byte
 MDMCFG4  |0x0010|0xF5|Modem Configuration
 MDMCFG3  |0x0011|0x83|Modem Configuration
 MDMCFG2  |0x0012|0x33|Modem Configuration
 DEVIATN  |0x0015|0x15|Modem Deviation Setting
 MCSM0    |0x0018|0x18|Main Radio Control State Machine Configuration
 FOCCFG   |0x0019|0x14|Frequency Offset Compensation Configuration
 AGCCTRL0 |0x001D|0x92|AGC Control
 WORCTRL  |0x0020|0xFB|Wake On Radio Control
 FREND0   |0x0022|0x11|Front End TX Configuration
 FSCAL3   |0x0023|0xE9|Frequency Synthesizer Calibration
 FSCAL2   |0x0024|0x2A|Frequency Synthesizer Calibration
 FSCAL1   |0x0025|0x00|Frequency Synthesizer Calibration
 FSCAL0   |0x0026|0x1F|Frequency Synthesizer Calibration
 TEST2    |0x002C|0x81|Various Test Settings
 TEST1    |0x002D|0x35|Various Test Settings
 TEST0    |0x002E|0x09|Various Test Settings
 */

//Async TX should work with EV1527SPI to send EV1527 data
/* SmartRF studio set these values:
 *
 {CC1101_IOCFG2,      0x0B},
 {CC1101_IOCFG0,      0x0C},
 {CC1101_FIFOTHR,     0x47},
 {CC1101_PKTCTRL0,    0x12},
 {CC1101_FREQ2,       0x10},
 {CC1101_FREQ1,       0xA7},
 {CC1101_FREQ0,       0x62},
 {CC1101_MDMCFG4,     0x87},
 {CC1101_MDMCFG3,     0x0C},
 {CC1101_MDMCFG2,     0x30},
 {CC1101_MDMCFG1,     0x00},
 {CC1101_FREND0,      0x11},
 {CC1101_FSCAL3,      0xE9},
 {CC1101_FSCAL2,      0x2A},
 {CC1101_FSCAL1,      0x00},
 {CC1101_FSCAL0,      0x1F},
 {CC1101_TEST2,       0x81},
 {CC1101_TEST1,       0x35},
 {CC1101_TEST0,       0x09},

 cc1101_writeSingleByte(FIFOTHR,0x47);//RX FIFO and TX FIFO Thresholds
 cc1101_writeSingleByte(MDMCFG2,0x30);//Modem Configuration
 cc1101_writeSingleByte(FREND0,0x11); //Front End TX Configuration
 cc1101_writeSingleByte(FSCAL3,0xEA); //Frequency Synthesizer Calibration
 cc1101_writeSingleByte(FSCAL2,0x2A); //Frequency Synthesizer Calibration
 cc1101_writeSingleByte(FSCAL1,0x00); //Frequency Synthesizer Calibration
 cc1101_writeSingleByte(FSCAL0,0x1F); //Frequency Synthesizer Calibration
 cc1101_writeSingleByte(TEST2,0x81);  //Various Test Settings
 cc1101_writeSingleByte(TEST1,0x35);  //Various Test Settings

 *
 */
static void setupAsyncTx(void)
{
    uint8_t u8 = 0;
    // Set up IO2 for 3-state
    /* Studio sent 0x0B, which means:
     * b7 unused, zero
     * b6 GDOx_INV, zero
     * b5:0 usage: 0x0B = gdox_serialClock
     * We don't need that, we are doing async
     */
    u8 = IOCFGx_GDOx_CFG(gdox_3state);
    cc1101_writeSingleByte(IOCFG2_REGADDR, u8);
    // Set GDO1 to 3-state as well, make all GDO pins low strength
    u8 = IOCFGx_GDOx_CFG(gdox_3state);
    cc1101_writeSingleByte(IOCFG1_REGADDR, u8);
    // Set up IO0 for data to TX in async mode
    /* Studio sent 0x0C, which is gdox_syncSerialDataOutput
     * I don't think it matters here, but we should set
     */
    u8 = IOCFGx_GDOx_CFG(gdox_3state);
    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x0C);
    /* Studio sent 0x47, which means
     * b6: ADC retention set, for <100kbps baud, good.
     * b3:0 0b0111, fine.
     */
    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47); //RX FIFO and TX FIFO Thresholds
    /* Studio sent 0x35 which means:
     * b7 clear, good
     * b6 white_data clear
     * b5:4 0b11, for async serial
     * b3 not used, zero, good.
     * b2 CRC enable, enabled, TURN OFF, change to 0b0
     * b1:0 LEN_CFG, 0b01=variable
     * So we want 0x31
     */
    u8 = PKTCTRL0_PKT_FORMAT_WRITE(pktCtrl0Format_asyncSerial);
//    u8 |= PKTCTRL0_CRC_EN;
    u8 |= PKTCTRL0_LENGTH_CFG(pktCtrl0Len_infinite);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x32); //Packet Automation Control

    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);   //Frequency Control Word, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xB1);   //Frequency Control Word, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x3A);   //Frequency Control Word, Low Byte

