colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0x87); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x0C); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x30); //Modem Configuration
    /* Studio sent 0x87, which means
     * b5:4, datasheet says to get from studio
     * b1:0 patable index for TXing a '1', so index 1
     */
    cc1101_writeSingleByte(FREND0_REGADDR, 0x11);  //Front End TX Configuration
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);  //Frequency Synthesizer Calibration

    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);   //Various Test Settings
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);   //Various Test Settings
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);   //Various Test Settings

    // PATABLE for TX
    uint8_t paTableBytes[8] = { 0x60, 0x60, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
    cc1101_writeBurst(PATABLE_REGADDR, paTableBytes, 8);
}

static void initPacketReceiver(void)
{
    m_rxSettings.pPacket = m_rxPacketBuffer;
    m_rxSettings.readFromChip = true;
    m_rxSettings.packetBufIndex = 0;
    m_rxSettings.packetBufLen = sizeof(m_rxPacketBuffer);
    m_rxSettings.rxState = packetRxState_awaitingPacketStart;
}

static void readInSettings(packetRxSettings_t* pSettings)
{
    uint8_t regByte;
    // Read the packet length config
    cc1101_readSingleByte(PKTCTRL0_REGADDR, &regByte);
    pSettings->packetLenCfg = PKTCTRL0_LENGTH_CFG(regByte);
    // Read whether the RSSI and LQI are appended
    cc1101_readSingleByte(PKTCTRL1_REGADDR, &regByte);
    if (regByte & PKTCTRL1_APPEND_STATUS)
    {
        pSettings->RSSIandLQIAppended = true;
        NRF_LOG_DEBUG("Read in settings: Expect appended RSSI and LQI");
    }
    if (pktCtrl0Len_fixed == pSettings->packetLenCfg)
    { // Read expected packet length
        cc1101_readSingleByte(PKTLEN_REGADDR, &pSettings->expectedPacketLen);
        NRF_LOG_DEBUG("Read in settings: Fixed packet len of %d", pSettings->expectedPacketLen);
    }
    else if (pktCtrl0Len_variable == pSettings->packetLenCfg)
    { // Read in max length, if desired
        NRF_LOG_DEBUG("Read in settings: Variable packet len");
    }
    else
    {
        NRF_LOG_ERROR("Read in settings: UNSUPPORTED packet len config %d", pSettings->packetLenCfg);
    }
    pSettings->readFromChip = false;
}

static void readRSSIandLQI(packetRxSettings_t* pSettings, uint8_t numFifoBytes)
{ // RSSI first, then LQI and CRC_OK
    cc1101_readSingleByte(RXFIFO_REGADDR, (uint8_t*)&pSettings->RSSI);
    uint8_t u8;
    cc1101_readSingleByte(RXFIFO_REGADDR, &u8);
    pSettings->LQI = LQI_LQI_EST(u8);
    pSettings->CRCok = (u8 & LQI_CRC_OK) ? true : false;
    pSettings->rxState = packetRxState_finishedWithPacket;
    NRF_LOG_DEBUG("Read RSSI %d ,LQI %d, CRC %s", pSettings->RSSI, pSettings->LQI,
                  pSettings->CRCok ? "ok or na" : "not ok");

    uint8_t u82;
    cc1101_readSingleByte(LQI_REGADDR, &u82);
    if (u8 != u82)
    {
        NRF_LOG_WARNING(" Read LQI regaddr: LQI %d, CRC %s", LQI_LQI_EST(u8), (u8&LQI_CRC_OK)?"ok":"not ok");
    }
}

static void readPacketBytes(packetRxSettings_t* pSettings, uint8_t numFifoBytes)
{
    uint32_t numExpected = pSettings->expectedPacketLen - pSettings->packetBufIndex;
    if (numFifoBytes < numExpected)
    { // If bytes are still coming in, don't empty the FIFO completely (section 20)
        cc1101_readBurst(RXFIFO_REGADDR, &pSettings->pPacket[pSettings->packetBufIndex], numFifoBytes - 1);
        pSettings->rxState = packetRxState_awaitingPacketBytes;
        pSettings->packetBufIndex += numFifoBytes - 1;
        NRF_LOG_INFO("fixedLen read %d of expected %d bytes, try again later", pSettings->packetBufIndex,
                     pSettings->expectedPacketLen);
    }
    else
    { // We have the bytes we need for a full packet, read them out, report done
        if (!numExpected)
        {
            NRF_LOG_ERROR("numExpected==0");
        }
        cc1101_readBurst(RXFIFO_REGADDR, &pSettings->pPacket[pSettings->packetBufIndex], numExpected);
        numFifoBytes -= numExpected;
        pSettings->packetBufIndex += numExpected;
        pSettings->rxState = packetRxState_receivedPacketBytes;
//        NRF_LOG_INFO("Read fixed length packet of %d bytes, done.", pSettings->packetBufIndex);
        if (pSettings->RSSIandLQIAppended)
        { // If we should read LQI and RSSI, try and read those
            if (2 <= numFifoBytes)
            {
                readRSSIandLQI(pSettings, numFifoBytes);
            }
            else
            { // Wait til next poll
                pSettings->rxState = packetRxState_awaitingRSSILQI;
            }
        }
        else
        {
            pSettings->rxState = packetRxState_finishedWithPacket;
        }
    }
}

static void readVariablePacket(packetRxSettings_t* pSettings, uint8_t numFifoBytes)
{
    if (packetRxState_awaitingPacketStart == pSettings->rxState)
    { // We need to read the first byte to know the length
        cc1101_readSingleByte(RXFIFO_REGADDR, &pSettings->expectedPacketLen); // First byte is length byte
        pSettings->rxState = packetRxState_awaitingPacketBytes;
// Now see if we have enough bytes to receive the rest
        numFifoBytes--;
        if (numFifoBytes)
        {
            readPacketBytes(pSettings, numFifoBytes);
        }
    }
    else if (packetRxState_awaitingPacketBytes == pSettings->rxState)
    { // If awaiting packet bytes, read them
        readPacketBytes(pSettings, numFifoBytes);
    }
    else
    {
        NRF_LOG_ERROR("Stuck, ??");
    }
}

static void parsePacketAndLQI(int8_t RSSI, uint8_t LQI, bool crcOK, uint8_t* pData, uint32_t len)
{
//    NRF_LOG_INFO("  RX %d-byte packet, RSSI %d, LQI %d, CRC %d.", len, RSSI, LQI, crcOK);
#ifdef UART_TX_PIN
    char strBuf[256];
    int strLen;

//    strLen = snprintf(strBuf, sizeof(strBuf), "%d", RSSI);
//    _4digit7seg_writeStr(strBuf);

//    strLen = snprintf(strBuf, sizeof(strBuf), "RX %d-byte packet, RSSI %d, LQI %d, CRC %d:\n", len, RSSI,
//                      LQI,
//                      crcOK);
//    if (0 < strLen)
//    {
//        uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
//    }
#endif // #ifdef UART_TX_PIN

