colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
    if (1 == len)
    {
        NRF_LOG_INFO(" RX 1-byte packet, TX power %d, RSSI %d, LQI %d, CRC %d.", (int8_t )pData[0], len, RSSI, LQI,
                     crcOK);
#ifdef UART_TX_PIN
        strLen = snprintf(strBuf, sizeof(strBuf), " RX 1-byte packet, TX power %d, RSSI %d, LQI %d, CRC %d.\n",
                          (int8_t)pData[0],
                          RSSI, LQI, crcOK);
        if (0 < strLen)
        {
            uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
        }
#endif // #ifdef UART_TX_PIN

    }
    if (2 <= len)
    { // 2nd byte holds the command on command, or ACKer's RSSI of our first command
        int8_t theirTxdBm = (int8_t)pData[0];
        cc1101_setOutputPower(theirTxdBm);
        switch (m_opMode)
        {
            case cc1101_packetRX:
                // If we are the motor driver, we receive the state to set
                globalInts_setMachineState((machineState_t)pData[1]);
                NRF_LOG_INFO(" RX command to mode %d. Sending ack.", (machineState_t )pData[1])
                ;
                NRF_LOG_INFO(" They sent at %d, RSSI %d, LQI %d, CRC %d.", theirTxdBm, RSSI, LQI, crcOK)
                ;
#ifdef UART_TX_PIN
                strLen = snprintf(strBuf, sizeof(strBuf), " RX CMD %d, TX %d dBm, RSSI %d, LQI %d, CRC %d.\n",
                                  pData[1],
                                  (int8_t)pData[0],
                                  RSSI,
                                  LQI, crcOK);
                if (0 < strLen)
                {
                    uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
                }
#endif // #ifdef UART_TX_PIN

                // Send an ACK when we RX a packet
                cc1101_sendPacket((uint8_t)RSSI);
            break;
            case cc1101_packetTX:
                // If we are the remote controller, we receive the RSSI that the driver heard our packet at.

                NRF_LOG_INFO(" RX ACK packet. Receiver heard us at %d.", (int8_t )pData[1])
                ;
                NRF_LOG_INFO(" They sent at %d, RSSI %d, LQI %d, CRC %d.", theirTxdBm, RSSI, LQI, crcOK)
                ;
#ifdef UART_TX_PIN
                strLen = snprintf(strBuf, sizeof(strBuf),
                                  " RX ACK of CMD, received at %d. ACK TX power %d, RSSI %d, LQI %d, CRC %d.\n",
                                  (int8_t)pData[1],
                                  (int8_t)pData[0],
                                  RSSI,
                                  LQI,
                                  crcOK);
                if (0 < strLen)
                {
                    uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
                }
#endif // #ifdef UART_TX_PIN
            break;
            default:
                NRF_LOG_INFO("  RX %d-byte packet, RSSI %d, LQI %d, CRC %d.", len, RSSI, LQI, crcOK)
                ;
            break;
        }

    }
}
static void tryReceivePacket(packetRxSettings_t* pSettings)
{
    uint8_t regByte;
    if (NULL == pSettings)
    {
        NRF_LOG_ERROR("NULL pSettings");
        return;
    }
    if (pSettings->readFromChip)
    {
        readInSettings(pSettings);
    }
    if (pSettings->packetBufIndex == pSettings->expectedPacketLen)
    {
        NRF_LOG_ERROR("Doesn't make sense, resetting receive state");
        pSettings->rxState = packetRxState_awaitingPacketStart;
        pSettings->packetBufIndex = 0;
    }
    // Read RXBYTES to see if there are any bytes
    cc1101_readSingleByte(RXBYTES_REGADDR, &regByte);
    if (regByte & RXBYTES_OVERFLOW)
    {
        NRF_LOG_WARNING("Rx OVERFLOW, flushing and going back to RX!");
        cc1101_strobe(STROBE_FLUSHRXFIFO);
        cc1101_strobe(STROBE_SRX);
        pSettings->rxState = packetRxState_awaitingPacketStart;
        pSettings->packetBufIndex = 0;
        return;
    }
    uint8_t numFifoBytes = RXBYTES_NUM(regByte);
    if (!numFifoBytes)
    { // No bytes to read
//        NRF_LOG_DEBUG("0 RXbytes");
        return;
    }
    // If here, we have bytes to read in RX FIFO
//    NRF_LOG_INFO("have %d bytes in RXFIFO", numFifoBytes);
    switch (pSettings->packetLenCfg)
    {
        case pktCtrl0Len_fixed:
            readPacketBytes(pSettings, numFifoBytes);
        break;
        case pktCtrl0Len_variable:
            NRF_LOG_WARNING("WHY are we in readVariablePacket?")
            ;
            readVariablePacket(pSettings, numFifoBytes);
        break;
        default:
            NRF_LOG_ERROR("Packet type %d not handled yet", pSettings->packetLenCfg)
            ;
        break;
    }
    // Try and parse it
    if (packetRxState_finishedWithPacket == m_rxSettings.rxState)
    {
        if (m_rxSettings.packetBufIndex != m_rxSettings.expectedPacketLen)
        {
            NRF_LOG_WARNING("Something wrong, didn't receive expected bytes, flush and idle");
        }
        else
        { // Parse it, if it looks OK.
            if (m_rxSettings.RSSIandLQIAppended)
            {
                parsePacketAndLQI(m_rxSettings.RSSI, m_rxSettings.LQI, m_rxSettings.CRCok, m_rxSettings.pPacket,
                                  m_rxSettings.packetBufLen);
            }
            else
            {
                NRF_LOG_WARNING("Packet without LQI, TODO parse");
            }

        }
//        cc1101_setIdle(true);
        m_rxSettings.rxState = packetRxState_awaitingPacketStart;
        m_rxSettings.packetBufIndex = 0;
    }
    else
    { // If not in finished state, check if length is equal, that would be an error
        if (m_rxSettings.packetBufIndex >= m_rxSettings.expectedPacketLen)
        {
            NRF_LOG_WARNING("Received %d of %d bytes, but state still %d, reset parser",
                            m_rxSettings.packetBufIndex,
                            m_rxSettings.expectedPacketLen,
                            m_rxSettings.rxState);
            // reset parser state
            m_rxSettings.rxState = packetRxState_awaitingPacketStart;
            m_rxSettings.packetBufIndex = 0;
        }
        else
        {
            // Keep waiting for packet, TODO timeout?
        }
    }
}

static void asyncTxPoll(void)
{
    if (uptimeCounter_elapsedSince(m_lastPoll_ms) < 100)
    { // Don't spam SPI bus, rate-limit checks
        return;
    }
    // If here, we have expired the timer and can ask it what's up.
    cc1101_strobe(STROBE_NOP); // Strobe NOP to get status
    // See if state has changed
    chipStatusByteState_t currentState = CHIPSTATUSBYTE_STATE(m_lastChipStatusByte);
    if (currentState != m_lastReadStatusByteState)
    {
        m_inState_ms = 0;
    }
    else
    { // If in state, increment timer
        m_inState_ms += uptimeCounter_elapsedSince(m_lastPoll_ms);
    }
    switch (currentState)
    {
        case statusByteState_tx:
            // Gets into this state from someone telling it to send a packet.
            if (statusByteState_tx != m_lastReadStatusByteState)
            {
                NRF_LOG_INFO("Went into TX state, good");
            }
        break;
        case statusByteState_rx:
            NRF_LOG_ERROR("Should not be in RX, idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_idle:
            // should not be in idle, go to TX state
            NRF_LOG_ERROR("Should NOT be in idle state, goto TX")
            ;
            cc1101_strobe(STROBE_STX);
        break;
        case statusByteState_rxOverflow:
            NRF_LOG_ERROR("Detected RX overflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_txUnderflow:
            NRF_LOG_ERROR("Detected TX underflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        default:
            //ignore for now
        break;
    }
    m_lastReadStatusByteState = currentState;
}

#if GDO2_STATUS
static chipStatusByteState_t checkOrPoll(void)
{
    bool shouldPoll = false;
    // Read GDO2 pin latch to see if it went high, current state to see if it went low
    bool gdo2WasHigh = nrf_gpio_pin_latch_get(CC1101_GDO2_PIN);
    nrf_gpio_pin_latch_clear(CC1101_GDO2_PIN); // Clear right at read, so it can set again if it goes high
    if (gdo2WasHigh)
    { // Asserts at start of TX or TX, then de-asserts when done sending/receiving packet.
        NRF_LOG_INFO("Detected high latch:");
        bool isHigh = nrf_gpio_pin_read(CC1101_GDO2_PIN);
        if (!isHigh)
        { // Once done with packet, we can poll status if we like.
            shouldPoll = true;
            NRF_LOG_INFO("Not high any more, done with RX or TX");
        }
    }
    if (shouldPoll)
    { // See if state has changed
        cc1101_strobe(STROBE_NOP); // Strobe NOP to get status
    }
    return CHIPSTATUSBYTE_STATE(m_lastChipStatusByte);
}
#else
static chipStatusByteState_t checkOrPoll(void)
{
    if (uptimeCounter_elapsedSince(m_lastPoll_ms) < STATUS_POLL_ITVL_MS)
    { // Don't spam SPI bus, especially when RXing
        return CHIPSTATUSBYTE_STATE(m_lastChipStatusByte);
    }
    // If here, we have expired the timer and can ask it what's up.
    cc1101_strobe(STROBE_NOP); // Strobe NOP to get status
    return CHIPSTATUSBYTE_STATE(m_lastChipStatusByte);
}
#endif // #if GDO2_STATUS

static void packetRxPoll(void)
{
    chipStatusByteState_t currentState = checkOrPoll(); // checkOrPoll will update state and return that
    if (currentState != m_lastReadStatusByteState)
    {
        m_inState_ms = 0;
    }
    else
    { // If in state, increment timer
        m_inState_ms += uptimeCounter_elapsedSince(m_lastPoll_ms);
    }
    switch (currentState)
    {
        case statusByteState_tx:
            if (TX_TIMEOUT_MS < m_inState_ms)
            { // Shouldn't take a long time to send

