colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
                NRF_LOG_ERROR("Timed out in TX state, idling")
                ;
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_rx:
            // If in receiving state
            if (0 == m_inState_ms)
            { // Reset RX parser on entry, then try and receive packet
                m_rxSettings.rxState = packetRxState_awaitingPacketStart;
                m_rxSettings.packetBufIndex = 0;
            }
            if (m_inState_ms >= 5000)
            { // It should transition to IDLE when done receiving a packet
                NRF_LOG_WARNING("Timed out in RX state, idling")
                ;
#ifdef UART_TX_PIN
                uartTerminal_enqueueToUSB((uint8_t*)"Timed out in RX, idling\n",
                                          strlen("Timed out in RX, idling\n"));
#endif // #ifdef UART_TX_PIN
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_idle:
            // Usually here because we received a packet, or because we errored and came here
//            NRF_LOG_DEBUG("Idle, last state %s", m_statuses[m_lastReadStatusByteState])
//            ;
            // In RX mode, switch to RX state ASAP
            if (m_newTxPower)
            {
                setTxPower(m_desiredTxdBm);
                m_newTxPower = false;
            }
            if (0 == m_inState_ms)
            { // Reset RX parser on entry, then try and receive packet
                m_rxSettings.rxState = packetRxState_awaitingPacketStart;
                m_rxSettings.packetBufIndex = 0;
            }
            // Check if we have received a packet
            tryReceivePacket(&m_rxSettings);
            // tryReceivePacket may parse a packet that says we should go into TX state.
            if (statusByteState_tx == CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
            {

            }
            else
            {
                NRF_LOG_DEBUG("poller start RX:")
                ;
//                cc1101_strobe(STROBE_FLUSHRXFIFO); // Can flush in idle
//                cc1101_strobe(STROBE_FLUSHTXFIFO); // Can flush in idle
                cc1101_strobe(STROBE_SRX);
                // Now assume it went to RX state. Don't ask it, in case it is in RX
                NRF_LOG_WARNING("Manual update");
                updateStatus(statusByteState_rx << 4); // Have to fake the whole byte
                m_inState_ms = 0;
            }
        break;
        case statusByteState_cal:
            break;
        case statusByteState_rxOverflow:
            NRF_LOG_ERROR("Detected RX overflow,idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_txUnderflow:
            NRF_LOG_ERROR("Detected TX underflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        default:
            if (m_inState_ms > 1000)
            {
                NRF_LOG_WARNING("State 0x%x, idling", CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
                ;
                cc1101_setIdle(true);
            }
        break;
    }
    m_lastReadStatusByteState = currentState;
}

static void packetTxPoll(void)
{
    chipStatusByteState_t currentState = checkOrPoll(); // checkOrPoll will update state and return that
    if (currentState != m_lastReadStatusByteState)
    {
        m_inState_ms = 0;
    }
    else
    { // If in state, increment timer
        m_inState_ms += uptimeCounter_elapsedSince(m_lastPoll_ms);
    }
    switch (currentState)
    {
        case statusByteState_tx:
            // Gets into this state from someone telling it to send a packet.
            if (m_inState_ms >= TX_TIMEOUT_MS)
            { // Shouldn't take a long time to send, TODO find time
                NRF_LOG_ERROR("Timed out in TX state, idling")
                ;
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_rx:
            if (RX_AFTER_TX_TIMEOUT_MS < m_inState_ms)
            {
                NRF_LOG_WARNING("Timed out in RX after %d ms, idling", m_inState_ms)
                ;
#ifdef UART_TX_PIN
                uartTerminal_enqueueToUSB((uint8_t*)"Timed out in RX, idling\n",
                                          strlen("Timed out in RX, idling\n"));
#endif // #ifdef UART_TX_PIN
                cc1101_setIdle(true);
            }
        break;
        case statusByteState_idle:
            // Idle until someone calls sendPacket
//            NRF_LOG_DEBUG("Idle, last state was %s", m_statuses[m_lastReadStatusByteState])
//            ;
            if (m_newTxPower)
            {
                setTxPower(m_desiredTxdBm);
                m_newTxPower = false;
            }
            if (0 == m_inState_ms)
            { // If we just changed state
                if (statusByteState_rx == m_lastReadStatusByteState)
                { // Coming from RX state, reset RX parser, try and parse a packet.
                    m_rxSettings.rxState = packetRxState_awaitingPacketStart;
                    m_rxSettings.packetBufIndex = 0;
                    // Usually here because we received a packet
                    tryReceivePacket(&m_rxSettings);
                }
                else if (statusByteState_tx == m_lastReadStatusByteState)
                { // Coming from TX, we should go to RX to receive an ACK
                    NRF_LOG_INFO("Go to RX after TX is done");
                    cc1101_strobe(STROBE_SRX);
                    // Now assume it went to RX state. Don't ask it, in case it is in RX
                    NRF_LOG_WARNING("Manual update");
                    updateStatus(statusByteState_rx << 4); // Have to fake the whole byte
                }
            }
            // Stay in idle until next TX command triggers TX, then TX to RX, then idle again.
        break;
        case statusByteState_rxOverflow:
            NRF_LOG_ERROR("Detected RX overflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        case statusByteState_txUnderflow:
            NRF_LOG_ERROR("Detected TX underflow, idling")
            ;
            cc1101_setIdle(true);
        break;
        default:
            if (m_inState_ms > 1000)
            {
                NRF_LOG_WARNING("State 0x%x, idling", CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
                ;
                cc1101_setIdle(true);
            }
        break;
    }
    m_lastReadStatusByteState = currentState;
}

