colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/nRF52_common/cc1101.c
static void cc1101Poll(void)
{
    switch (m_opMode)
    {
        case cc1101_asyncTX:
            asyncTxPoll();
        break;
        case cc1101_packetRX:
            packetRxPoll();
        break;
        case cc1101_packetTX:
            packetTxPoll();
        break;
        default:
            break;
    }

#if TX_TEST_ITVL_MS
if (uptimeCounter_elapsedSince(m_lastTx_ms) >= TX_TEST_ITVL_MS)
{
    // TODO run a TX packet
    uint8_t txPacketBytes[PKT_LEN];
    for (uint8_t i = 0; i < PKT_LEN; i++)
    {
        txPacketBytes[i] = i;
    }
    cc1101_sendPacket(txPacketBytes, PKT_LEN);
    m_lastTx_ms = uptimeCounter_getUptimeMs();
}
#endif // #if TX_TEST_ITVL_MS

    m_lastPoll_ms = uptimeCounter_getUptimeMs();

}

bool cc1101_sendPacket(uint8_t byte)
{
    uint8_t pktBuf[PKT_LEN];
    pktBuf[0] = (uint8_t)m_desiredTxdBm;
    pktBuf[1] = byte;
    bool ret = true;
    ret &= cc1101_writeBurst(TXFIFO_REGADDR, pktBuf, PKT_LEN);
    ret &= cc1101_readSingleByte(TXBYTES_REGADDR, pktBuf);
    if (PKT_LEN == pktBuf[0])
    {
//        NRF_LOG_DEBUG("Sending packet of %d bytes at %d dBm.", PKT_LEN, m_desiredTxdBm);
#if verbose_tx
        NRF_LOG_DEBUG("Sending packet of %d bytes at %d dBm.", PKT_LEN, m_desiredTxdBm);
#ifdef UART_TX_PIN
        uint8_t strBytes[256];
        int printlen = snprintf((char*)strBytes, sizeof(strBytes), "CC1101 sending %d bytes at %d dBm\n", PKT_LEN,
                                m_desiredTxdBm);
        if (0 < printlen)
        {
            uartTerminal_enqueueToUSB(strBytes, (uint32_t)printlen);
        }
#endif // #ifdef UART_TX_PIN
#endif // #if verbose_tx
    }
    else
    {
        NRF_LOG_WARNING("Sending packet of %d bytes at %d dBm to txfifo, BUT TXYBTES says %d", PKT_LEN,
                        m_desiredTxdBm,
                        pktBuf[0]);
    }
    ret &= cc1101_strobe(STROBE_STX);
    NRF_LOG_WARNING("Manual update to TX");
    updateStatus(statusByteState_tx << 4); // Have to fake the whole byte
    return ret;

}

cc1101Mode_t cc1101_readMode(void)
{
    return m_opMode;
}

void cc1101_setOutputPower(int8_t tx_dBm)
{
    if (m_desiredTxdBm != tx_dBm)
    {
        NRF_LOG_INFO("Desire change of power to %d dBm", tx_dBm);
#ifdef UART_TX_PIN
        char strBuf[96];
        int strLen = snprintf(strBuf, sizeof(strBuf), "Desire TX %d dBm\n", tx_dBm);
        if (0 < strLen)
        {
            uartTerminal_enqueueToUSB((const uint8_t*)strBuf, (uint32_t)strLen);
        }
#endif // #ifdef UART_TX_PIN
        m_desiredTxdBm = tx_dBm;
        m_newTxPower = true;
    }
}

static void setupGDO2Input(uint8_t pin)
{ // GDO2 will go high at beginning of packet RX, then low when done receiving. Sense the first high-going edge.
    nrf_gpio_cfg(pin,
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_CONNECT,
                 GPIO_PIN_CNF_PULL_Pulldown,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_SENSE_HIGH);
}

void cc1101_init(cc1101Mode_t desired)
{
    spi0_init(); // Make sure pins are muxed and working
    m_lastChipStatusByte = 0x8F;
    bool testPass = cc1101_reboot();
    if (!testPass)
    {
        NRF_LOG_ERROR("Couldn't reboot CC1101");
        return;
    }
    testPass = cc1101_selfTest();
    if (!testPass)
    {
        NRF_LOG_ERROR("CC1101 self-test failed");
        return;
    }
// If here, init it
//    cc1101_initASKTx_myStudio();
    m_opMode = cc1101_unknownMode;

    ev1527SPI_turnOff(SPI2_MOSI_PIN); // Default to off.

    switch (desired)
    {
        case cc1101_packetRX:
            setupGDO2Input(CC1101_GDO2_PIN);
            initPacketReceiver();
            setupPacketRadio(-20); // Same settings for Rx side
            m_opMode = cc1101_packetRX;
        break;
        case cc1101_packetTX:
            setupGDO2Input(CC1101_GDO2_PIN);
            initPacketReceiver();
            setupPacketRadio(-20); // Same settings for Rx side
            m_opMode = cc1101_packetTX;
        break;
        case cc1101_asyncTX:
            // do NOT set up the MOSI pin to drive yet, until we de-init the default CC1101 drive as output.
            setupAsyncTx();
            // Now set up our output pin, which should idle low to not send.
            ev1527SPI_init(SPI2_MOSI_PIN); // init SPI, which idles low.
            cc1101_strobe(STROBE_STX); // Start TX of CC1101, to send what comes out MOSI
            m_opMode = cc1101_asyncTX;
            NRF_LOG_WARNING("Be sure to wire SPI2_MOSI pin %d to CC1101 GDO0", SPI2_MOSI_PIN)
            ;
        break;
        default:
            NRF_LOG_ERROR("Don't know how to set  up mode %d\n", desired)
            ;
        break;
    }

    pollers_registerPoller(cc1101Poll);
}

